&НаСервере
Процедура ОформлениеПолейСправочникаПоРезультатуСрегистраСведений()
	УсловноеОформлениеСписка = Список.КомпоновщикНастроек.Настройки.УсловноеОформление;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыбранныеВопросы.Вопросы КАК Вопрос
		|ИЗ
		|	РегистрСведений.ВыбранныеВопросы КАК ВыбранныеВопросы";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
			
		// Условное оформление
		ЭлементОформления = УсловноеОформлениеСписка.Элементы.Добавить();
		// как оформить
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Зеленый );
		// условия применения оформления
		ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Вопрос");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Выборка.Вопрос;
		// какие поля оформить
		//ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
		//ОформлениеПолей.Поле = Новый ПолеКомпоновкиДанных("Наименование");
			
	КонецЦикла;
	
КонецПроцедуры	


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОформлениеПолейСправочникаПоРезультатуСрегистраСведений();
КонецПроцедуры
