  
Функция ОпределитьКоличествоПравельныхВопросов()     Экспорт
	 		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ПравельныеОтветы.Вопросы) КАК Кол
		|ИЗ
		|	РегистрСведений.ПравельныеОтветы КАК ПравельныеОтветы";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат  Выборка.Кол;
	КонецЕсли;
	Возврат 0;
	

КонецФункции  


Функция ОпределитьКоличествоНеправельныхВопросов()         Экспорт
	 		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(НеПравельныеОтветыУчитьЗаново.Вопросы) КАК Кол
		|ИЗ
		|	РегистрСведений.НеПравельныеОтветыУчитьЗаново КАК НеПравельныеОтветыУчитьЗаново";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат  Выборка.Кол;
	КонецЕсли;
	Возврат 0;
	

КонецФункции	


Функция ВсегоВопросов()     Экспорт
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ВопросыТест.Ссылка) КАК Кол
		|ИЗ
		|	Справочник.ВопросыТест КАК ВопросыТест
		|ГДЕ
		|	ВопросыТест.ЭтоГруппа = ЛОЖЬ
		|	И ВопросыТест.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Кол;	
	КонецЕсли;
	Возврат 0;
	
КонецФункции	

Функция ПройденоТестов()    Экспорт
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ПодсчетПройденныхТестов.Количество) КАК Количество
		|ИЗ
		|	РегистрСведений.ПодсчетПройденныхТестов КАК ПодсчетПройденныхТестов";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		 Возврат Выборка.Количество;
	КонецЕсли;
	Возврат 0;
	
	
КонецФункции	