
&НаКлиенте
Процедура Константы(Команда)
	//Способ №1
	ОткрытьФорму("ОбщаяФорма.ФормаКонстант");
КонецПроцедуры

&НаКлиенте
Процедура НачатьТест(Команда)
	ОткрытьФорму("Обработка.Тест.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеВопросы(Команда)
	ОткрытьФорму("РегистрСведений.ВыбранныеВопросы.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура РаботаНадОшибками(Команда)
	ОткрытьФорму("РегистрСведений.НеправельныеОтветы.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ВопросыДляТаста(Команда)
	ОткрытьФорму("Справочник.ВопросыТест.Форма.ФормаСписка"); 
КонецПроцедуры

&НаКлиенте
Процедура РезультатыТеста(Команда)
	ОткрытьФорму("РегистрСведений.РезультатТеста.Форма.ФормаСписка");
КонецПроцедуры
