
&НаКлиенте
Процедура Константы(Команда)
	//Способ №1
	ОткрытьФорму("ОбщаяФорма.ФормаКонстант");
КонецПроцедуры

&НаКлиенте
Процедура НачатьТест(Команда)
	ОткрытьФорму("Обработка.Тест.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеВопросы(Команда)
	ОткрытьФорму("РегистрСведений.ВыбранныеВопросы.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура РаботаНадОшибками(Команда)
	ОткрытьФорму("РегистрСведений.НеправельныеОтветы.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ВопросыДляТаста(Команда)
	ОткрытьФорму("Справочник.ВопросыТест.Форма.ФормаСписка"); 
КонецПроцедуры

&НаКлиенте
Процедура РезультатыТеста(Команда)
	ОткрытьФорму("РегистрСведений.РезультатТеста.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Проверка(Команда)
	ОткрытьФорму("Обработка.ТестПроверка.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура НеправельныеОтветы(Команда)
	ОткрытьФорму("РегистрСведений.НеПравельныеОтветыУчитьЗаново.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ПравельныеОтветы(Команда)
	ОткрытьФорму("РегистрСведений.ПравельныеОтветы.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьКоличествоВопросов()
	НеправельныеОтветыВсего = ОбщееСервер.ОпределитьКоличествоНеправельныхВопросов();
	ПравельныеОтветыВсего = ОбщееСервер.ОпределитьКоличествоПравельныхВопросов();
	ВсегоВопросов = ОбщееСервер.ВсегоВопросов();   
	
	ОсталосьВопросов 	  = ВсегоВопросов - ПравельныеОтветыВсего; 
	ПройденоВопросовВсего =  ПравельныеОтветыВсего +  НеправельныеОтветыВсего;
КонецПроцедуры	

&НаКлиенте
Процедура ПройденоТестов()
	ПройденоТестов = ОбщееСервер.ПройденоТестов();	
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОпределитьКоличествоВопросов();
	ПройденоТестов();  
	ОбновитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму()
	ПодключитьОбработчикОжидания("ДанныеДляобновления",30);	
КонецПроцедуры     

&НаКлиенте
Процедура ДанныеДляобновления() 
	ОпределитьКоличествоВопросов();
	ПройденоТестов();  	
КонецПроцедуры	

