
//рабочая область
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ВариантыОтветовПравельно.Доступность = Ложь;
	Элементы.ВариантыОтветовДополнительныеОтметки.Видимость=Ложь; 
	Элементы.ВариантыОтветовПравельно.Видимость=Ложь;
	Элементы.КоличествоОтветовПравельно.Видимость=Ложь;
	Элементы.КоличествоОтветовНеправельно.Видимость=Ложь;
КонецПроцедуры
                                                                                                   


#Область ФормированиеВопросов
&НаСервере
Функция ВыборкаВопросовДляТестирования()  
	Перем Глава;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыбранныеВопросы.Вопросы КАК Вопросы,
		|	ВыбранныеВопросы.Глава КАК Глава,
		|	ВЫБОР
		|		КОГДА ВыбранныеВопросы.Глава = ЗНАЧЕНИЕ(Перечисление.Главы.Глава1)
		|			ТОГДА 1
		|		КОГДА ВыбранныеВопросы.Глава = ЗНАЧЕНИЕ(Перечисление.Главы.Глава2)
		|			ТОГДА 2
		|		КОГДА ВыбранныеВопросы.Глава = ЗНАЧЕНИЕ(Перечисление.Главы.Глава3)
		|			ТОГДА 3
		|		КОГДА ВыбранныеВопросы.Глава = ЗНАЧЕНИЕ(Перечисление.Главы.Глава4)
		|			ТОГДА 4
		|		КОГДА ВыбранныеВопросы.Глава = ЗНАЧЕНИЕ(Перечисление.Главы.Глава5)
		|			ТОГДА 5
		|		КОГДА ВыбранныеВопросы.Глава = ЗНАЧЕНИЕ(Перечисление.Главы.Глава6)
		|			ТОГДА 6
		|		КОГДА ВыбранныеВопросы.Глава = ЗНАЧЕНИЕ(Перечисление.Главы.Глава7)
		|			ТОГДА 7
		|		КОГДА ВыбранныеВопросы.Глава = ЗНАЧЕНИЕ(Перечисление.Главы.Глава8)
		|			ТОГДА 8
		|		КОГДА ВыбранныеВопросы.Глава = ЗНАЧЕНИЕ(Перечисление.Главы.Глава9)
		|			ТОГДА 9
		|		КОГДА ВыбранныеВопросы.Глава = ЗНАЧЕНИЕ(Перечисление.Главы.Глава10)
		|			ТОГДА 10
		|		КОГДА ВыбранныеВопросы.Глава = ЗНАЧЕНИЕ(Перечисление.Главы.Глава11)
		|			ТОГДА 11
		|		КОГДА ВыбранныеВопросы.Глава = ЗНАЧЕНИЕ(Перечисление.Главы.Глава12)
		|			ТОГДА 12
		|		КОГДА ВыбранныеВопросы.Глава = ЗНАЧЕНИЕ(Перечисление.Главы.Глава13)
		|			ТОГДА 13
		|		КОГДА ВыбранныеВопросы.Глава = ЗНАЧЕНИЕ(Перечисление.Главы.Глава14)
		|			ТОГДА 14
		|	КОНЕЦ КАК НомерГлавы
		|ИЗ
		|	РегистрСведений.ВыбранныеВопросы КАК ВыбранныеВопросы
		|ГДЕ
		|	НЕ ВыбранныеВопросы.Вопросы В
		|				(ВЫБРАТЬ
		|					ПравельныеОтветы.Вопросы КАК Вопросы
		|				ИЗ
		|					РегистрСведений.ПравельныеОтветы КАК ПравельныеОтветы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерГлавы";
	
	//Запрос.УстановитьПараметр("ГлаваС",Объект.ГлаваС);
	//Запрос.УстановитьПараметр("ГлаваПо",Объект.ГлаваПо);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	Глава1  = Новый Массив();
	Глава2  = Новый Массив();
	Глава3  = Новый Массив();
	Глава4  = Новый Массив();
	Глава5  = Новый Массив();
	Глава6  = Новый Массив();
	Глава7  = Новый Массив();
	Глава8  = Новый Массив();
	Глава9  = Новый Массив();
	Глава10 = Новый Массив();
	Глава11 = Новый Массив();
	Глава12 = Новый Массив();
	Глава13 = Новый Массив();
	Глава14 = Новый Массив();
    //КоличествоИтераций = 0;
	// перебор вопросов
	Пока Выборка.Следующий() Цикл
		ГлаваИзЗапроса = Выборка.Глава;
		Если ГлаваИзЗапроса = Перечисления.Главы.Глава1 Тогда
			Глава1.Добавить(Выборка.Вопросы);	
		КонецЕсли;	
		Если ГлаваИзЗапроса = Перечисления.Главы.Глава2 Тогда
			Глава2.Добавить(Выборка.Вопросы);	
		КонецЕсли;
		Если ГлаваИзЗапроса = Перечисления.Главы.Глава3 Тогда
			Глава3.Добавить(Выборка.Вопросы);	
		КонецЕсли;
		Если ГлаваИзЗапроса = Перечисления.Главы.Глава4 Тогда
			Глава4.Добавить(Выборка.Вопросы);	
		КонецЕсли;
		Если ГлаваИзЗапроса = Перечисления.Главы.Глава5 Тогда
			Глава5.Добавить(Выборка.Вопросы);	
		КонецЕсли;
		Если ГлаваИзЗапроса = Перечисления.Главы.Глава6 Тогда
			Глава6.Добавить(Выборка.Вопросы);	
		КонецЕсли;
		Если ГлаваИзЗапроса = Перечисления.Главы.Глава7 Тогда
			Глава7.Добавить(Выборка.Вопросы);	
		КонецЕсли;
		Если ГлаваИзЗапроса = Перечисления.Главы.Глава8 Тогда
			Глава8.Добавить(Выборка.Вопросы);	
		КонецЕсли;
		Если ГлаваИзЗапроса = Перечисления.Главы.Глава9 Тогда
			Глава9.Добавить(Выборка.Вопросы);	
		КонецЕсли;
		Если ГлаваИзЗапроса = Перечисления.Главы.Глава10 Тогда
			Глава10.Добавить(Выборка.Вопросы);	
		КонецЕсли;
		Если ГлаваИзЗапроса = Перечисления.Главы.Глава11 Тогда
			Глава11.Добавить(Выборка.Вопросы);	
		КонецЕсли;
		Если ГлаваИзЗапроса = Перечисления.Главы.Глава12 Тогда
			Глава12.Добавить(Выборка.Вопросы);	
		КонецЕсли;
		Если ГлаваИзЗапроса = Перечисления.Главы.Глава13 Тогда
			Глава13.Добавить(Выборка.Вопросы);	
		КонецЕсли;
		Если ГлаваИзЗапроса = Перечисления.Главы.Глава14 Тогда
			Глава14.Добавить(Выборка.Вопросы);	
		КонецЕсли;  
		//КоличествоИтераций = КоличествоИтераций +1;
	КонецЦикла;
	
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	СлучайноеЧисло = ГСЧ.СлучайноеЧисло(0,100);  
	ЧетырнадцатьВопросов = Новый Массив; 
	Если Глава1.Количество()> 0 Тогда
		Если Глава1.Количество()< СлучайноеЧисло  Тогда
			ЧетырнадцатьВопросов.Добавить(Глава1[Глава1.Количество()-1]); 
		Иначе
			ЧетырнадцатьВопросов.Добавить(Глава1[СлучайноеЧисло]);
		КонецЕсли;
	КонецЕсли;
	Если Глава2.Количество()< СлучайноеЧисло  Тогда
		ЧетырнадцатьВопросов.Добавить(Глава2[Глава2.Количество()-1]); 
	ИначеЕсли Глава2.Количество()> 0 Тогда
		ЧетырнадцатьВопросов.Добавить(Глава2[СлучайноеЧисло]);
	КонецЕсли;
	Если Глава3.Количество()> 0 Тогда 
		Если Глава3.Количество()< СлучайноеЧисло  Тогда   
			ЧетырнадцатьВопросов.Добавить(Глава3[Глава3.Количество()-1]);
		Иначе
			ЧетырнадцатьВопросов.Добавить(Глава3[СлучайноеЧисло]);
		КонецЕсли;
	КонецЕсли;		
	Если Глава4.Количество()> 0 Тогда 
		Если Глава4.Количество()< СлучайноеЧисло  Тогда  
			ЧетырнадцатьВопросов.Добавить(Глава4[Глава4.Количество()-1]);
		Иначе
			ЧетырнадцатьВопросов.Добавить(Глава4[СлучайноеЧисло]);	
		КонецЕсли;
	КонецЕсли;		 
	Если Глава5.Количество()> 0 Тогда
		Если Глава5.Количество()< СлучайноеЧисло  Тогда
			ЧетырнадцатьВопросов.Добавить(Глава5[Глава5.Количество()-1]);
		Иначе 
			ЧетырнадцатьВопросов.Добавить(Глава5[СлучайноеЧисло]);
		КонецЕсли;
	КонецЕсли;		
	Если Глава6.Количество()> 0 Тогда
		Если Глава6.Количество()< СлучайноеЧисло  Тогда
			ЧетырнадцатьВопросов.Добавить(Глава6[Глава6.Количество()-1]); 
		Иначе
			ЧетырнадцатьВопросов.Добавить(Глава6[СлучайноеЧисло]);
		КонецЕсли;
	КонецЕсли;	 	
	Если Глава7.Количество()> 0 Тогда	
		Если Глава7.Количество()< СлучайноеЧисло  Тогда 
			ЧетырнадцатьВопросов.Добавить(Глава7[Глава7.Количество()-1]); 
		Иначе 
			ЧетырнадцатьВопросов.Добавить(Глава7[СлучайноеЧисло]);
		КонецЕсли;
	КонецЕсли;		
	Если Глава8.Количество()> 0 Тогда 
		Если Глава8.Количество()< СлучайноеЧисло  Тогда 
			ЧетырнадцатьВопросов.Добавить(Глава8[Глава8.Количество()-1]);	
		Иначе
			ЧетырнадцатьВопросов.Добавить(Глава8[СлучайноеЧисло]);
		КонецЕсли;
	КонецЕсли; 
	Если Глава9.Количество()> 0 Тогда
		Если Глава9.Количество()< СлучайноеЧисло  Тогда
			ЧетырнадцатьВопросов.Добавить(Глава9[Глава9.Количество()-1]);	
		Иначе
			ЧетырнадцатьВопросов.Добавить(Глава9[СлучайноеЧисло]);
		КонецЕсли;	
	КонецЕсли;	
	Если Глава10.Количество()> 0 Тогда
		Если Глава10.Количество()< СлучайноеЧисло  Тогда 
			ЧетырнадцатьВопросов.Добавить(Глава10[Глава10.Количество()-1]);
		Иначе
		    ЧетырнадцатьВопросов.Добавить(Глава10[СлучайноеЧисло]);
		КонецЕсли;
	КонецЕсли;	
	Если Глава11.Количество()> 0 Тогда
		Если Глава11.Количество()< СлучайноеЧисло  Тогда
			ЧетырнадцатьВопросов.Добавить(Глава11[Глава11.Количество()-1]); 
		Иначе
		    ЧетырнадцатьВопросов.Добавить(Глава11[СлучайноеЧисло]); 
		КонецЕсли;
	КонецЕсли;	 
	Если Глава12.Количество()> 0 Тогда 
		Если Глава12.Количество()< СлучайноеЧисло  Тогда
			ЧетырнадцатьВопросов.Добавить(Глава12[Глава12.Количество()-1]); 
		Иначе
			ЧетырнадцатьВопросов.Добавить(Глава12[СлучайноеЧисло]);
		КонецЕсли;
	КонецЕсли;
	Если Глава13.Количество()> 0 Тогда 
		Если Глава13.Количество()< СлучайноеЧисло  Тогда 
			ЧетырнадцатьВопросов.Добавить(Глава13[Глава13.Количество()-1]); 
        Иначе
			ЧетырнадцатьВопросов.Добавить(Глава13[СлучайноеЧисло]);	
		КонецЕсли;
	КонецЕсли;		
	Если Глава14.Количество()> 0 Тогда 
		Если Глава14.Количество()< СлучайноеЧисло  Тогда  
			ЧетырнадцатьВопросов.Добавить(Глава14[Глава14.Количество()-1]); 
		Иначе
			ЧетырнадцатьВопросов.Добавить(Глава14[СлучайноеЧисло]);	
		КонецЕсли;	 
	КонецЕсли;

	
	Возврат ЧетырнадцатьВопросов;	
КонецФункции	                                                                       		
#КонецОбласти   

#Область ЗагрузкаНаФормуВопросов 

&НаКлиенте
Процедура ЗагрузитьВопросы(Команда) 
	СообщениеОКоличествеВопросов = "";
	Элементы.СообщениеОКоличествеВопросов.Видимость=Ложь;   
	Элементы.КоличествоОтветовПравельно.Видимость=Ложь;
	Элементы.КоличествоОтветовНеправельно.Видимость = Ложь;
	ЭтаФорма.КоличествоОтветовПравельно = 0;
	ЭтаФорма.КоличествоОтветовНеправельно = 0; 
	ЭтаФорма.КоличествоВопросовВсего = 0;
	ЭтаФорма.ОсталосьОтветитьНаВопросы = 0;
	//Очистка формы
	ЭтаФорма.ВариантыОтветов.Очистить();
	
	ВопросыДляЗагрузки = ВыборкаВопросовДляТестирования();
	Если ПоказатьОтвет = Ложь Тогда
		ЗапускТаймераОбщее(); 
	КонецЕсли;
	ЭтаФорма.КоличествоВопросовВсего = ВопросыДляЗагрузки.Количество();
	
	Для Каждого Строка из ВопросыДляЗагрузки Цикл
		НоваяСтрока = ЭтаФорма.Вопросы.Добавить();
		ДанныеДляТЗ = ЗагрузитьВопросыНаСервере(Строка);
		НоваяСтрока["Вопрос"] = ДанныеДляТЗ.Вопрос;
		НоваяСтрока["Ссылка"] = ДанныеДляТЗ.Ссылка;   
	КонецЦикла;	
	ДвигатьсяВперед(Истина);
	ПоказатьОтвет();
КонецПроцедуры
&НаСервере
Функция ЗагрузитьВопросыНаСервере(Строка)
	 ЭлементВопрос = Строка.ПолучитьОбъект(); 
	 Результат = Новый Структура;
	 Для Каждого СтрокиОтветов из ЭлементВопрос.ВариантыОтветов Цикл
		ЕщеСтрока = ЭтаФорма.ВариантыОтветов.Добавить();
		ЕщеСтрока["Вопрос"] = ЭлементВопрос.Вопрос;
		ЕщеСтрока["Ответ"] = СтрокиОтветов.Ответ;
		ЕщеСтрока["ПравельныйОтвет"] = СтрокиОтветов.ПравельныйОтвет;
		ЕщеСтрока["ДополнительныеОтметки"] = СтрокиОтветов.ДополнительныеОтметки;	
	 КонецЦикла;
	 Результат.Вставить("Вопрос",ЭлементВопрос.Вопрос);
	 Результат.Вставить("Ссылка",ЭлементВопрос.Ссылка);
	 
	 Возврат  Результат;
КонецФункции	
&НаСервере
Процедура ПодготовитьВопросКОтображению()
	КоличествоВопросов = ЭтаФорма.Вопросы.Количество();  
	Если КоличествоВопросов = 0 Тогда
		Возврат;
	КонецЕсли;	
	
		ЭтаФорма.ОсталосьОтветитьНаВопросы  =  КоличествоВопросов;
		ГСЧ = Новый ГенераторСлучайныхЧисел;

		СлучайноеЧисло = ГСЧ.СлучайноеЧисло(0, КоличествоВопросов-1);		
		Объект.Вопрос = ЭтаФорма.Вопросы[СлучайноеЧисло].Вопрос;
		Объект.Ссылка = ЭтаФорма.Вопросы[СлучайноеЧисло].Ссылка;		
		КартинкаВопроса = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"ДанныеКартинки");
		Элементы.КартинкаВопроса.РазмерКартинки = РазмерКартинки.Пропорционально;
		Объект.ВариантыОтветов.Очистить();
			Для Каждого Строка из ЭтаФорма.ВариантыОтветов Цикл  
				Если Строка(Объект.Вопрос) = Строка(Строка.Вопрос) Тогда
					НоваяСтрока = Объект.ВариантыОтветов.Добавить();
					НоваяСтрока.Вариант = Строка.Ответ;
					НоваяСтрока.ПравельныйОтвет = Строка.ПравельныйОтвет;
					НоваяСтрока.ДополнительныеОтметки = Строка.ДополнительныеОтметки;
				КонецЕсли;
			КонецЦикла;	
		// Перед удалением считываем данные с строки	
		ЭтаФорма.Вопросы.Удалить(СлучайноеЧисло);

КонецПроцедуры	
&НаКлиенте
Процедура ЗадатьВопрос()
	ПоказатьВопрос(Новый ОписаниеОповещения("ВопросЗаписьВРегистрСведений",ЭтотОбъект),"Записать результат тестирования?",РежимДиалогаВопрос.ДаНет);	
КонецПроцедуры	

&НаСервере
Процедура ДвигатьсяВперед(ЗагрузкаВопросов)  
	Если ЭтаФорма.ОсталосьОтветитьНаВопросы = 1 и ЭтаФорма.Вопросы.Количество()=0 Тогда
		ЭтаФорма.ОсталосьОтветитьНаВопросы = ЭтаФорма.ОсталосьОтветитьНаВопросы -1;		
	КонецЕсли;
	Если ЗагрузкаВопросов Тогда
		ПодготовитьВопросКОтображению();
	Иначе	
		Если ЭтаФорма.ОсталосьОтветитьНаВопросы = 0  Тогда
			ЗаписатьРезультатПослеТеста();
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Вопросов нет";
			Сообщение.Сообщить();	
			ЭтаФорма.ВариантыОтветов.Очистить(); 
			РезультатТестирования();
		Иначе 
			ПодготовитьВопросКОтображению();		
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры	
#КонецОбласти

#Область Время

&НаКлиенте
Процедура ЗапускТаймераОбщее()
	ПодключитьОбработчикОжидания("ХодВремениДляСекундомераНаУвеличениеОбщее",1);
	Элементы.ТаймерОбщий.Заголовок = 0;
КонецПроцедуры	
&НаКлиенте
Процедура ОтключитьТаймерОбщее()
	ОтключитьОбработчикОжидания("ХодВремениДляСекундомераНаУвеличениеОбщее");
КонецПроцедуры	

// Процедура - Ход общего времени для секундомера на увеличение  
//
&НаКлиенте
Процедура ХодВремениДляСекундомераНаУвеличениеОбщее()   // подсчет времени на убывание
		Элементы.ТаймерОбщий.Заголовок = Число(Элементы.ТаймерОбщий.Заголовок)+1; // отнимем каждый раз по 1 секунде
		//Получаем минуты, для получения часов секунды делим на 3600
		Минуты = Цел(Число(Элементы.ТаймерОбщий.Заголовок)/60);
		//Считаем остаток
		ОстатокСекунд = Число(Элементы.ТаймерОбщий.Заголовок)%60;
		
		Если ОстатокСекунд < 10 Тогда               // выводим таймер в определенном формате
			Элементы.ТаймерВыводОбщий.Заголовок = "" + Минуты+ ":0"+ ОстатокСекунд;
			
		Иначе
			Элементы.ТаймерВыводОбщий.Заголовок = "" + Минуты+ ":"+ ОстатокСекунд;
		КонецЕсли;		
КонецПроцедуры
#КонецОбласти

#Область ВыборОтвета  

&НаКлиенте
Процедура СледующийВопрос()  
	Элементы.ВариантыОтветовВыбор.Доступность = Истина;
	Элементы.ВариантыОтветовДополнительныеОтметки.Видимость = Ложь;	
	ДвигатьсяВперед(Ложь);
	Если ЭтаФорма.ОсталосьОтветитьНаВопросы = 0   Тогда
		ОтключитьТаймерОбщее();
		Элементы.КоличествоОтветовПравельно.Видимость=Истина;
		Элементы.КоличествоОтветовНеправельно.Видимость=Истина;  
		Если ЭтаФорма.КоличествоОтветовНеправельно < 3 Тогда
			ТестПройден();
			Запустить_exe(); 
	 	КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры
&НаКлиенте
Процедура Следующий(Команда)
	   СледующийВопрос(); 
	   ПоказатьОтвет();
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуНаКартинку(СсылкаНаКартинку)
	КартинкаОбъект = СсылкаНаКартинку.ПолучитьОбъект();
	Картинка = ПолучитьНавигационнуюСсылку(КартинкаОбъект.Ссылка,"ДанныеКартинкиОтвет");

	Возврат Картинка; 
КонецФункции // ПолучитьСсылкуНаКартинку()

&НаКлиенте
Процедура ПоказатьКартинкуОтвета(СсылкаНаКартинку)
	Картинка = ПолучитьСсылкуНаКартинку(СсылкаНаКартинку);
	Если Картинка <> Неопределено Тогда
		ПараметрыСтруктура = Новый Структура("Картинка",Картинка);
		ФормаОткрыть = ПолучитьФорму("ОбщаяФорма.ФормаПоказатьКартинку",ПараметрыСтруктура);
		ФормаОткрыть.Открыть();
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура Проверка()
	ТекущиеДанные = Элементы.ВариантыОтветов.ТекущиеДанные;  
	Если ЭтаФорма.ОсталосьОтветитьНаВопросы = 0 Тогда
		  Элементы.КоличествоОтветовПравельно.Видимость=Истина;
		  Элементы.КоличествоОтветовНеправельно.Видимость=Истина;
		  РезультатТестирования();
		  //ПоказатьВопрос(Новый ОписаниеОповещения("ВопросЗаписьВРегистрСведений",ЭтотОбъект),"Записать результат тестирования?",РежимДиалогаВопрос.ДаНет);
		  //Объект.ВариантыОтветов.Очистить();
		  //ВариантыОтветов.Очистить();
		   
		  Если КоличествоОтветовНеправельно > 0 Тогда
		  	//СформироватьОтчет();
		 КонецЕсли;
	 КонецЕсли;

	Если ТекущиеДанные.Выбор = ТекущиеДанные.Правельныйответ  Тогда   // сравнение ответа с правельным ответом
		 ТекущиеДанные.Правельно = Истина;
		 ЭтаФорма.КоличествоОтветовПравельно =  ЭтаФорма.КоличествоОтветовПравельно + 1; 
		 УдалениеНеправельногоОтвета();  
		 Если  ПравельныйОтветНеЗаписывать = Ложь Тогда 
		 	ЗаписатьПравельныйОтвет()                     
		 КонецЕсли; 
		 Если ЗаписыватьРезультатПослеТеста Тогда
			 ЗаписьРезультатаПослеТеста(Истина);
	     КонецЕсли;		 
	 Иначе
		 ЭтаФорма.КоличествоОтветовНеправельно = ЭтаФорма.КоличествоОтветовНеправельно +1; 
		 Для Каждого Строка из Объект.ВариантыОтветов  Цикл
			 Если Строка.ПравельныйОтвет = Истина Тогда 
				 Строка.Правельно = Истина; 
		     КонецЕсли;		 
		 КонецЦикла;
		 
		  
		 Если ЗаписыватьРезультатПослеТеста Тогда
			 ЗаписьРезультатаПослеТеста(Ложь);
		 Иначе
			 ЗаписатьНеправельногоОтвета();
	     КонецЕсли;	
		 //ПоказатьКартинкуОтвета(Объект.Ссылка);
	 КонецЕсли;	
	 	  
КонецПроцедуры	

&НаСервере
Процедура ЗаписьРезультатаПослеТеста(Результат)
	 ЗаписьПослеТеста.Вопрос = Объект.Ссылка;
	 ЗаписьПослеТеста.Результат = Результат;
КонецПроцедуры	

&НаКлиенте
Процедура ВариантыОтветовВыборПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ВариантыОтветов.ТекущиеДанные;
	Для Каждого Строка Из  Объект.ВариантыОтветов Цикл 
		Если Не Строка.Вариант = ТекущиеДанные.Вариант Тогда
			 Строка.Выбор = Ложь;
			 
		КонецЕсли;	
	КонецЦикла;	
	Проверка(); 
    Элементы.ВариантыОтветовВыбор.Доступность = Ложь;
	Для Каждого Строка Из  Объект.ВариантыОтветов Цикл 
		Если Строка.ДополнительныеОтметки = Истина Тогда 
			Элементы.ВариантыОтветовДополнительныеОтметки.Видимость = Ложь;
			Элементы.ВариантыОтветовДополнительныеОтметки.Доступность = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла; 
	ПроверитьОтвет();	
	//Если Вопросы.Количество()>0 Тогда
	//	СледующийВопрос();
	//КонецЕсли;	
КонецПроцедуры	    

 &НаСервере
 Процедура Запустить_exe()
	 ПутьКФайлу = Константы.Феерверк.Получить();      
	 //ЗапуститьПриложение(СтрокаКоманды, [ТекущийКаталог], [ДождатьсяЗавершения], [КодВозврата])
	 ЗапуститьПриложение("Firework.exe",ПутьКФайлу,Истина);
 КонецПроцедуры	 

#КонецОбласти

#Область ЗаписьРезультатовОтвета
&НаКлиенте
Процедура  ВопросЗаписьВРегистрСведений(РезультатВопроса, ДополнительныеПараметры)     Экспорт
	 Элементы.ВариантыОтветовВыбор.Доступность = Истина;

	Если РезультатВопроса= КодВозвратаДиалога.Да Тогда
		РезультатТестирования();
	КонецЕсли;
	
	Если РезультатВопроса= КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет()
	
	 //Создаем табличный документ
	 ТабДокумент = Новый ТабличныйДокумент;
	 
	 //Указываем ориентацию страницы.
	 //Портретная по умолчанию
	 ТабДокумент.ОриентацияСтраницы =
	 ОриентацияСтраницы.Портрет;
	 РаботаВМенеджере(ТабДокумент);
	 ТабДокументОтображатьСетку = Ложь;
	 ТабДокумент.Показать();	  
	 НеправельныеОтветы.Очистить(); 
 КонецПроцедуры	

 &НаСервере
Процедура РаботаВМенеджере(ТабДокумент)
	Обработки.Тест.Печать(ТабДокумент,НеправельныеОтветы); 
КонецПроцедуры	 

&НаСервере
Процедура РезультатТестирования()
		Объект.ВариантыОтветов.Очистить();
		МенеджерЗаписи = РегистрыСведений.РезультатТеста.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ТекущаяДата();
		//МенеджерЗаписи.ВидТестирования = Объект.ВидТестирования;
		//МенеджерЗаписи.Глава = Объект.Глава;
		МенеджерЗаписи.ВопросовВсего = ЭтаФорма.КоличествоВопросовВсего;
		МенеджерЗаписи.НеправельныеОтветы = ЭтаФорма.КоличествоОтветовНеправельно;
		МенеджерЗаписи.ПравельныеОтветы = ЭтаФорма.КоличествоОтветовПравельно;
		МенеджерЗаписи.Время = Элементы.ТаймерВыводОбщий.Заголовок;
		МенеджерЗаписи.ПроцентОшибок = Окр(ЭтаФорма.КоличествоОтветовНеправельно * 100 /  ЭтаФорма.КоличествоВопросовВсего,0);
		МенеджерЗаписи.Записать();	
		
КонецПроцедуры	

&НаСервере
Процедура ТестПройден()
	МенеджерЗаписи = РегистрыСведений.ПодсчетПройденныхТестов.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Пройден = "Пройден";
	МенеджерЗаписи.Количество = 1;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры	
#КонецОбласти

#Область ЗаписьРазультатаВыбораОтвета
&НаСервере
Процедура ЗаписатьПравельныйОтвет()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПравельныеОтветы.Период 		 КАК Период,
		|	ПравельныеОтветы.Глава 			 КАК Глава,
		|	ПравельныеОтветы.Вопросы 		 КАК Вопрос
		|ИЗ
		|	РегистрСведений.ПравельныеОтветы КАК ПравельныеОтветы
		|ГДЕ
		|	ПравельныеОтветы.Вопросы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	МенеджерЗаписи = РегистрыСведений.ПравельныеОтветы.СоздатьМенеджерЗаписи();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Если Выборка.Вопрос = Объект.Ссылка Тогда
			Возврат;	
		КонецЕсли;	
	Иначе
		МенеджерЗаписи.Период = ТекущаяДата();
		МенеджерЗаписи.Глава = Объект.Ссылка.Глава; 
		МенеджерЗаписи.Вопросы = Объект.Ссылка;
		МенеджерЗаписи.Записать(Ложь);
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура ЗаписатьНеправельногоОтвета()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НеПравельныеОтветыУчитьЗаново.Период 			КАК Период,
		|	НеПравельныеОтветыУчитьЗаново.Глава 			КАК Глава,
		|	НеПравельныеОтветыУчитьЗаново.Вопросы 			КАК Вопрос
		|ИЗ
		|	РегистрСведений.НеПравельныеОтветыУчитьЗаново 	КАК НеПравельныеОтветыУчитьЗаново
		|ГДЕ
		|	НеПравельныеОтветыУчитьЗаново.Вопросы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	МенеджерЗаписи = РегистрыСведений.НеПравельныеОтветыУчитьЗаново.СоздатьМенеджерЗаписи();
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если Выборка.Вопрос = Объект.Ссылка Тогда
			Возврат;	
		КонецЕсли;	
	Иначе
		МенеджерЗаписи.Период = ТекущаяДата();
		МенеджерЗаписи.Глава = Объект.Ссылка.Глава;
	    МенеджерЗаписи.Вопросы = Объект.Ссылка;
		МенеджерЗаписи.Записать(Ложь); 
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура УдалениеНеправельногоОтвета()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НеПравельныеОтветыУчитьЗаново.Период 			КАК Период,
		|	НеПравельныеОтветыУчитьЗаново.Глава 			КАК Глава,
		|	НеПравельныеОтветыУчитьЗаново.Вопросы 			КАК Вопрос
		|ИЗ
		|	РегистрСведений.НеПравельныеОтветыУчитьЗаново 	КАК НеПравельныеОтветыУчитьЗаново
		|ГДЕ
		|	НеПравельныеОтветыУчитьЗаново.Вопросы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	МенеджерЗаписи = РегистрыСведений.НеПравельныеОтветыУчитьЗаново.СоздатьМенеджерЗаписи();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если Выборка.Вопрос = Объект.Ссылка Тогда 
			МенеджерЗаписи.Вопросы  = Объект.Ссылка;
			МенеджерЗаписи.Удалить();	
		КонецЕсли;	
	КонецЕсли;
	
	
КонецПроцедуры	
&НаКлиенте
Процедура ЗаписатьНеправельныйОтветДляОтчета()
	Вопрос = Объект.Вопрос;
	
	Для каждого Элемент Из Объект.ВариантыОтветов  Цикл
				
			НС = НеправельныеОтветы.Добавить();
			НС.Вопрос = Вопрос; 
			НС.Ответ =  Элемент.Вариант;
			НС.ПравельныйОтвет = Элемент.ПравельныйОтвет;
	КонецЦикла;
	
КонецПроцедуры	

&НаСервере
Процедура ЗаписатьРезультатПослеТеста()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПравельныеОтветы.Вопросы КАК Вопрос
		|ИЗ
		|	РегистрСведений.ПравельныеОтветы КАК ПравельныеОтветы";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
    МЗПравельно = РегистрыСведений.ПравельныеОтветы.СоздатьМенеджерЗаписи();

	Для Каждого Строка из ЗаписьПослеТеста Цикл  
		Если Строка.Результат Тогда
			Пока Выборка.Следующий() Цикл
				Если Выборка.Вопрос = Строка.Вопрос Тогда
				 	Продолжить;
			 	Иначе    
				 
					МЗПравельно.Период = ТекущаяДата();
					МЗПравельно.Глава = Объект.Ссылка.Глава; 
					МЗПравельно.Вопросы = Объект.Ссылка;
					МЗПравельно.Записать(Ложь);
 
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;	
	
	//Запись неправельных ответов    
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НеПравельныеОтветыУчитьЗаново.Вопросы КАК Вопросы
		|ИЗ
		|	РегистрСведений.НеПравельныеОтветыУчитьЗаново КАК НеПравельныеОтветыУчитьЗаново";
	
	РезультатЗапроса = Запрос.Выполнить();
	МЗНеправельно = РегистрыСведений.НеПравельныеОтветыУчитьЗаново.СоздатьМенеджерЗаписи();
	Выборка = РезультатЗапроса.Выбрать();
	
	Для Каждого Строка из ЗаписьПослеТеста Цикл  
		Если Строка.Результат = Ложь Тогда
			Пока Выборка.Следующий() Цикл
				Если Выборка.Вопрос = Строка.Вопрос Тогда
				 	Продолжить;
			 	Иначе    		 
					МЗПравельно.Период = ТекущаяДата();
					МЗПравельно.Глава = Объект.Ссылка.Глава; 
					МЗПравельно.Вопросы = Объект.Ссылка;
					МЗПравельно.Записать(Ложь);
				КонецЕсли; 
			КонецЦикла;	
		КонецЕсли;
	КонецЦикла;		
КонецПроцедуры
#КонецОбласти

#Область ОформлениеВариантовОтветов  
 &НаКлиенте
 Процедура ПоказатьОтвет()
	 Если ПоказатьОтвет Тогда
		 УстановитьУсловноеОформлениеПравельныйответ();
		 Элементы.ВариантыОтветовПравельныйОтвет.Видимость = Истина; 
	 Иначе
		 Элементы.ВариантыОтветовПравельныйОтвет.Видимость = Ложь;
	 КонецЕсли;	 
 КонецПроцедуры	
 
 &НаКлиенте
 Процедура ПроверитьОтвет()
	  Если ПроверятьОтвет Тогда
		 УстановитьУсловноеОформлениеПравельныйответ();
		 Элементы.ВариантыОтветовПравельныйОтвет.Видимость = Истина; 
	 Иначе
		 Элементы.ВариантыОтветовПравельныйОтвет.Видимость = Ложь;
	 КонецЕсли;	 

 КонецПроцедуры	 

 &НаСервере  
 //Не работает
 Процедура УстановитьУсловноеОформлениеПравельныйответ()
	// Для УО формы добавление происходит через прикладной объект УсловноеОформление:
    УФ = УсловноеОформление.Элементы.Добавить();
	// Создаем условие отбора
	ЭлементОтбора = УФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВариантыОтветов.ПравельныйОтвет");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;  
	ЭлементОтбора.ПравоеЗначение = Истина; 
	ЭлементОтбора.Использование = Истина;
	
	//Оформляемые поля
	ПолеОформление = УФ.Поля.Элементы.Добавить();
	ПолеОформление.Поле = Новый ПолеКомпоновкиДанных("ВариантыОтветов.Вариант");
	ПолеОформление.Использование = Истина;
	
 КонецПроцедуры	 

&НаКлиенте
 Процедура ПоказатьОтветПриИзменении(Элемент)
	 ПоказатьОтвет();
 КонецПроцедуры

 
#КонецОбласти